<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PriceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            // Дома из различных материалов
            [
                'section' => "Цены на строительство",
                'name' => "Дома из газоблока",
                'unit' => "м²",
                'price' => 55000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из пеноблоков",
                'unit' => "м²",
                'price' => 55000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из арболитовых блоков",
                'unit' => "м²",
                'price' => 55000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из керамзитоблоков",
                'unit' => "м²",
                'price' => 55000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из керамических блоков",
                'unit' => "м²",
                'price' => 55000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из силикатных блоков",
                'unit' => "м²",
                'price' => 55000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из бруса",
                'unit' => "м²",
                'price' => 61000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из профилированного бруса",
                'unit' => "м²",
                'price' => 61000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из клееного бруса",
                'unit' => "м²",
                'price' => 61000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из двойного бруса",
                'unit' => "м²",
                'price' => 61000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из строганного бруса",
                'unit' => "м²",
                'price' => 61000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из оцилиндрованного бревна",
                'unit' => "м²",
                'price' => 61000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из кирпича",
                'unit' => "м²",
                'price' => 59000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из SIP панелей",
                'unit' => "м²",
                'price' => 30000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из лафета",
                'unit' => "м²",
                'price' => 61000.00,
                'link' => "#"
            ],
            [
                'section' => "Цены на строительство",
                'name' => "Дома из ЛСТК",
                'unit' => "м²",
                'price' => 30000.00,
                'link' => "#"
            ],

            // Водоснабжение
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж точки водоснабжения",
                'unit' => "шт.",
                'price' => 1400.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж распределительного коллектора водоснабжения",
                'unit' => "шт.",
                'price' => 5000.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж сантехнического коллекторного шкафа",
                'unit' => "шт.",
                'price' => 1500.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж подводки воды к полотенцесушителю",
                'unit' => "шт.",
                'price' => 2900.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж насосной станции",
                'unit' => "м",
                'price' => 5800.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж редуктора давления До Ø32 мм",
                'unit' => "м",
                'price' => 2300.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж скважинного насоса (Скважина до 100 м)",
                'unit' => "шт.",
                'price' => 4400.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж погружного насоса",
                'unit' => "шт.",
                'price' => 4100.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж электрического водонагревателя до 100 л",
                'unit' => "шт.",
                'price' => 3800.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж труб системы водоснабжения ХВС, ГВС открыто",
                'unit' => "м.п.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж труб системы водоснабжения ХВС, ГВС в штрабе (кирпич, гипс)",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж труб системы водоснабжения ХВС, ГВС в штрабе (бетон)",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж трубной теплоизоляции на трубопроводы",
                'unit' => "м",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Установка счетчика воды ХВС, ГВС",
                'unit' => "шт.",
                'price' => 2100.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Установка фильтра грубой очистки воды (грязевика)",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Водоснабжение",
                'name' => "Монтаж фильтров тонкой очистки",
                'unit' => "шт.",
                'price' => 800.00,
                'link' => "#"
            ],

            // Возведение и кладка стен (из prices.html)
            [
                'section' => "Возведение и кладка стен",
                'name' => "Кладка из кирпича несущих и ограждающих конструкций стен",
                'unit' => "м3",
                'price' => 1900.00,
                'link' => "#"
            ],
            [
                'section' => "Возведение и кладка стен",
                'name' => "Кладка из керамзитоблоков / керамических блоков несущих и ограждающих конструкций стен",
                'unit' => "м3",
                'price' => 2400.00,
                'link' => "#"
            ],
            [
                'section' => "Возведение и кладка стен",
                'name' => "Кладка из блоков (пеноблок, газоблок, арболитоблок, силикатный блок) несущих и ограждающих конструкций стен",
                'unit' => "м3",
                'price' => 1100.00,
                'link' => "#"
            ],
            [
                'section' => "Возведение и кладка стен",
                'name' => "Кладка перегородок",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Возведение и кладка стен",
                'name' => "Кладка арочных сводов оконных и дверных проемов",
                'unit' => "м.п.",
                'price' => 600.00,
                'link' => "#"
            ],
            [
                'section' => "Возведение и кладка стен",
                'name' => "Установка ж/б перемычек на растворе",
                'unit' => "шт.",
                'price' => 800.00,
                'link' => "#"
            ],
            [
                'section' => "Возведение и кладка стен",
                'name' => "Устройство монолитных ж/б перекрытий",
                'unit' => "м3",
                'price' => 2000.00,
                'link' => "#"
            ],
            [
                'section' => "Возведение и кладка стен",
                'name' => "Устройство монолитных ж/б некратных участков",
                'unit' => "м3",
                'price' => 4700.00,
                'link' => "#"
            ],
            [
                'section' => "Возведение и кладка стен",
                'name' => "Изготовление деревянных перекрытий с утеплением",
                'unit' => "м²",
                'price' => 400.00,
                'link' => "#"
            ],
            [
                'section' => "Возведение и кладка стен",
                'name' => "Установка плит перекрытий с нивелировкой и заделкой мест опирания",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],

            // Земляные работы (из prices.html)
            [
                'section' => "Земляные работы",
                'name' => "Разбивка участка, вынос координат объекта",
                'unit' => "точка",
                'price' => 2200.00,
                'link' => "#"
            ],
            [
                'section' => "Земляные работы",
                'name' => "Разработка грунта механизированным способом",
                'unit' => "м3",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Земляные работы",
                'name' => "Разработка грунта вручную",
                'unit' => "м3",
                'price' => 400.00,
                'link' => "#"
            ],
            [
                'section' => "Земляные работы",
                'name' => "Обратная засыпка грунта вручную с послойным уплотнением",
                'unit' => "м3",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Земляные работы",
                'name' => "Подготовка уплотненного основания из песка вручную послойно до 300 мм",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Земляные работы",
                'name' => "Подготовка уплотненного основания из песка вручную послойно свыше 300 мм",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Земляные работы",
                'name' => "Подготовка уплотненного основания из щебня вручную послойно до 300 мм",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Земляные работы",
                'name' => "Подготовка уплотненного основания из щебня вручную послойно свыше 300 мм",
                'unit' => "м²",
                'price' => 700.00,
                'link' => "#"
            ],

            // Канализация (из prices.html)
            [
                'section' => "Канализация",
                'name' => "Прокладка канализационной трубы, наружным диаметром до 110 мм. в подготовленной траншее с формированием песчаной подушки, выставлением уклона и теплоизоляцией",
                'unit' => "м.п.",
                'price' => 700.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Прокладка канализационной трубы, наружным диаметром до 110 мм.",
                'unit' => "м.п.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Прокладка канализационной трубы, наружным диаметром более 110 мм.",
                'unit' => "м.п.",
                'price' => 400.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Монтаж греющего кабеля внутрь трубы канализации",
                'unit' => "м.п.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Утепление участка трубы канализации при вводе в здание",
                'unit' => "шт.",
                'price' => 1000.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Устройство дренажа фундамента глубиной до 1 метра",
                'unit' => "м.п.",
                'price' => 1500.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Устройство дренажа фундамента глубиной до 2 метров",
                'unit' => "м.п.",
                'price' => 4700.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Обвязка септика по системе канализации",
                'unit' => "шт.",
                'price' => 1200.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Монтаж септика (емкости)",
                'unit' => "шт.",
                'price' => 17000.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Копка и установка кольца колодца КС 10-9 (зависит от грунта)",
                'unit' => "шт.",
                'price' => 1700.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Скрепление колец скобами",
                'unit' => "шт.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Гидроизоляция швов колодца",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Заделка отверстий трубы между колодцами",
                'unit' => "шт.",
                'price' => 1300.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Установка люка(чугун,пластик)",
                'unit' => "шт.",
                'price' => 1000.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Штробление по бетону (до 50мм.)",
                'unit' => "м.п.",
                'price' => 400.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Штробление по кирпичу (до 50мм.)",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Штробление по штукатурке (до 50мм.)",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Штробление по монолитному армированному бетону (до 50мм.)",
                'unit' => "м.п.",
                'price' => 900.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Штробление по бетону (до 110мм.)",
                'unit' => "м.п.",
                'price' => 700.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Штробление по кирпичу (до 110мм.)",
                'unit' => "м.п.",
                'price' => 600.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Штробление по штукатурке (до 110мм.)",
                'unit' => "м.п.",
                'price' => 600.00,
                'link' => "#"
            ],
            [
                'section' => "Канализация",
                'name' => "Штробление по монолитному армированному бетону (до 110мм.)",
                'unit' => "м.п.",
                'price' => 2000.00,
                'link' => "#"
            ],

            // Кровля крыши (из prices.html)
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж стропильной системы",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж мауэрлата",
                'unit' => "м.п.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Антисептирование пиломатериалов (огне-био защита)",
                'unit' => "м²",
                'price' => 30.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Устройство контробрешетки",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Устройство шаговой обрешетки",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Устройство сплошной обрешетки из доски",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Устройство сплошной обрешетки (настила) из фанеры или ОСП-3 по готовому основанию",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж пароизоляции (с проклейкой скотчем)",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж гидроизоляции (гидроветрозащиты)",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Укладка утеплителя (утепление кровли)",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж битумной гибкой черепицы",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж металлочерепицы",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж профнастила",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж ондулина",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж конька/хребта",
                'unit' => "м.п.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж карнизной планки (капельник)",
                'unit' => "м.п.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж ветровой (торцевой) планки",
                'unit' => "м.п.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Устройство примыканий к стенам/трубам",
                'unit' => "м.п.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Обустройство ендовы",
                'unit' => "м.п.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Устройство битумной гидроизоляции (подкладочный ковер)",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Установка системы снегозадержания",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Устройство каркаса карнизных и фронтонных свесов",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Подшивка карнизных и торцевых свесов пластиковыми панелями (софит)",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Подшивка карнизных и торцевых свесов доской",
                'unit' => "м.п.",
                'price' => 400.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Окраска деревянных поверхностей в 2 слоя",
                'unit' => "м.п.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж водосточных желобов",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж водосточных труб",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Монтаж мансардных окон в ходе кровельных работ",
                'unit' => "шт.",
                'price' => 2400.00,
                'link' => "#"
            ],
            [
                'section' => "Кровля крыши",
                'name' => "Установка мансардных окон в готовую кровлю",
                'unit' => "шт.",
                'price' => 2600.00,
                'link' => "#"
            ],

            // Облицовка домов (из prices.html)
            [
                'section' => "Облицовка домов",
                'name' => "Монтаж/демонтаж строительных лесов",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Облицовка лицевым одинарным кирпичом \"под расшивку\" без рисунка",
                'unit' => "м²",
                'price' => 1400.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Облицовка лицевым одинарным кирпичом \"под расшивку\" с рисунком",
                'unit' => "м²",
                'price' => 800.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Облицовка лицевым полуторным кирпичом \"под расшивку\" без рисунка",
                'unit' => "м²",
                'price' => 800.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Облицовка лицевым полуторным кирпичом \"под расшивку\" с рисунком",
                'unit' => "м²",
                'price' => 1000.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Монтаж теплоизоляционных плит ЭППС (до 100 мм)",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Монтаж минераловатных теплоизоляционных плит (до 100 мм)",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Штукатурка фасада слоем до 5 мм с армированием",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Декоративная штукатурка с подготовкой",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Оштукатуривание рустов прямых",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Оштукатуривание рустов закругленных",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Покраска фасада (1 слой)",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Покраска фасада (2 слоя)",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Облицовка стен клинкерной плиткой",
                'unit' => "м²",
                'price' => 800.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Облицовка стен сайдингом с утеплением на каркасе",
                'unit' => "м²",
                'price' => 500.00,
                'link' => "#"
            ],
            [
                'section' => "Облицовка домов",
                'name' => "Облицовка стен, цоколей природным/искусственным камнем с подготовкой штукатурного основания и утеплением",
                'unit' => "м²",
                'price' => 1500.00,
                'link' => "#"
            ],

            // Отопление
            [
                'section' => "Отопление",
                'name' => "Установка, обвязка батареи",
                'unit' => "точка",
                'price' => 3600.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Установка, обвязка батареи (квартира)",
                'unit' => "точка",
                'price' => 5400.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж коллекторного шкафа С.О. (встроенного)",
                'unit' => "шт.",
                'price' => 6800.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж коллекторного шкафа С.О.(открытая установка)",
                'unit' => "шт.",
                'price' => 1900.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж стояков системы отопления до Ø 40 мм",
                'unit' => "м/п",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж теплотрассы системы отопления до Ø 40 мм",
                'unit' => "м/п",
                'price' => 600.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Установка насоса системы отопления",
                'unit' => "шт.",
                'price' => 4000.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж группы безопасности котла",
                'unit' => "шт.",
                'price' => 2400.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Установка РБ системы отопления",
                'unit' => "шт.",
                'price' => 2400.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Установка кранов, задвижек, балансировочных вентилей",
                'unit' => "шт.",
                'price' => 400.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Установка и обвязка настенного котла",
                'unit' => "шт.",
                'price' => 13100.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Установка и обвязка напольного котла (до 60 КВт)",
                'unit' => "шт.",
                'price' => 21200.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж котельной частного дома",
                'unit' => "шт.",
                'price' => 21100.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж котельной с погодозависимой автоматикой",
                'unit' => "шт.",
                'price' => 49000.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Опрессовка системы отопления частного дома",
                'unit' => "шт.",
                'price' => 4300.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Диагностика системы отопления, с выездом (до 50 км)",
                'unit' => "выезд",
                'price' => 1700.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Сборка и монтаж радиатора отопления",
                'unit' => "шт.",
                'price' => 3100.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж внутрипольного конвектора отопления",
                'unit' => "шт.",
                'price' => 2100.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж нестандартного радиатора (чугунные радиаторы, радиаторы нестандартных размеров, дизайн радиаторы)",
                'unit' => "шт.",
                'price' => 4000.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж распределительного коллектора радиаторного отопления",
                'unit' => "шт.",
                'price' => 2300.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж распределительного коллекторного шкафа",
                'unit' => "шт.",
                'price' => 900.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж магистральных труб системы отопления в теплоизоляции (металлопластик, сшитый полиэтилен) до Ø16-20 мм",
                'unit' => "шт.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Прокладка магистральных труб системы отопления (металлопластик, сшитый полиэтилен) Ø25- 32 мм",
                'unit' => "шт.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Прокладка магистральных труб системы отопления (полипропилен) до Ø32 мм",
                'unit' => "шт.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Прокладка магистральных труб системы отопления (полипропилен) до Ø40-50 мм",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж трубной изоляции на трубопроводы",
                'unit' => "м.п",
                'price' => 30.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Заправка системы теплоносителем (для домов площадью до 250 м²)",
                'unit' => "шт.",
                'price' => 2500.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Заправка системы теплоносителем (для домов площадью 250-500 м²)",
                'unit' => "шт.",
                'price' => 3400.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Опрессовка системы (для домов площадью до 250м² )",
                'unit' => "шт.",
                'price' => 2800.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж теплотрассы предварительно теплоизолированной",
                'unit' => "м",
                'price' => 1000.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж настенного двухконтурного котла до 30 кВт и гидравлическая обвязка и установка отсечной запорной арматуры",
                'unit' => "шт.",
                'price' => 10300.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж твердотопливного котла до 50 кВт и гидравлическая обвязка и установка отсечной запорной арматуры",
                'unit' => "шт.",
                'price' => 13400.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж настенного электрического котла до 30 кВт и гидравлическая обвязка и установка отсечной запорной арматуры",
                'unit' => "шт.",
                'price' => 14300.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж пеллетного котла до 50 кВт и гидравлическая обвязка и установка отсечной запорной арматуры",
                'unit' => "шт.",
                'price' => 12500.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж дизельной горелки (газ/дизель) до 65 кВт",
                'unit' => "шт.",
                'price' => 2900.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж распределительного коллектора котельной до 60 кВт и подключение к тепловому контуру",
                'unit' => "шт.",
                'price' => 3800.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж распределительного коллектора котельной от 60 кВт и подключение к тепловому контуру",
                'unit' => "шт.",
                'price' => 11100.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж группы безопасности котла/водонагревателя",
                'unit' => "шт.",
                'price' => 2200.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж водонагревателя косвенного нагрева до 200 л. и гидравлическая обвязка",
                'unit' => "шт.",
                'price' => 7000.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж накопительного водонагревателя / буферной емкости до 1000 л. и гидравлическая обвязка",
                'unit' => "шт.",
                'price' => 13500.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж расширительного бака до 100 л. и гидравлическая обвязка",
                'unit' => "шт.",
                'price' => 2100.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж группы регулирования температуры теплого пола",
                'unit' => "шт.",
                'price' => 3900.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж циркуляционного насоса до Ø32 мм",
                'unit' => "шт.",
                'price' => 3400.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж насосной группы до Ø32 мм",
                'unit' => "шт.",
                'price' => 2400.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж и обвязка топливного бака, установка фикспакета, монтаж магистрали (до 10 м) до горелки",
                'unit' => "шт.",
                'price' => 5600.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж топливного фильтра",
                'unit' => "шт.",
                'price' => 2300.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж крана шарового, косого фильтра, обратного клапана, воздухоотводчика за ед.",
                'unit' => "шт.",
                'price' => 500.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж манометра, термометра, термоманометра за ед.",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж водяных «теплых полов»",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж распределительного коллектора напольного отопления",
                'unit' => "шт.",
                'price' => 4800.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж распределительного коллекторного шкафа",
                'unit' => "шт.",
                'price' => 800.00,
                'link' => "#"
            ],
            [
                'section' => "Отопление",
                'name' => "Монтаж группы регулирования температуры теплого пола",
                'unit' => "шт.",
                'price' => 3300.00,
                'link' => "#"
            ],

            // Проектирование домов и коттеджей
            [
                'section' => "Проектирование домов и коттеджей",
                'name' => "Проектирование домов и коттеджей",
                'unit' => "м²",
                'price' => 500.00,
                'link' => "#"
            ],

            // Ремонт и отделка
            [
                'section' => "Ремонт и отделка",
                'name' => "Пробивка проемов в ж/б стенах",
                'unit' => "м²",
                'price' => 3300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Усиление проемов металлическим профилем",
                'unit' => "м.п.",
                'price' => 2100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Гидроизоляция пола мастиками",
                'unit' => "м²",
                'price' => 500.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Гидроизоляция пола рулонными материалами (два слоя) на битумной мастике",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство самовыравнивающейся стяжки пола",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство стяжки пола до 50 мм.",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство «сухого пола» Авангард - Кнауф (10мм)",
                'unit' => "м²",
                'price' => 600.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Армирование стяжки пола",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство перегородок в 1/2 кирпича",
                'unit' => "м²",
                'price' => 400.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство перегородок в 1 кирпич",
                'unit' => "м²",
                'price' => 800.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство перегородок из шлакоблоков, пазогребневых блоков",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство стен из гипсокартона, перегородок с теплоизоляцией",
                'unit' => "м²",
                'price' => 800.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Облицовка стен гипсокартоном с теплоизоляцией (1-слой)",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Облицовка стен гипсокартоном на клею",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство тепло-звукоизоляции стен (изоспан, минвата, пенопласт)",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Гидроизоляция стен (в зависимости от влажности помещения)",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Армирование стен штукатурной сеткой",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Штукатурка стен",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Штукатурка стен (под плитку)",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Штукатурная отделка проемов (откосов)",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство реечных подвесных потолков",
                'unit' => "м²",
                'price' => 700.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Монтаж подвесного потолка \"Армстронг\"",
                'unit' => "м²",
                'price' => 700.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство подвесного потолка из гипсокартона (1-слой)",
                'unit' => "м²",
                'price' => 600.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство разноуровнего потолка из ГКЛ с прямолинейными элементами",
                'unit' => "м²",
                'price' => 1700.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство разноуровнего потолка из ГКЛ сложных геометрических форм с криволинейными элементами",
                'unit' => "м²",
                'price' => 2000.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Монтаж структурного покрытия",
                'unit' => "м²",
                'price' => 500.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Грунтовка потолка",
                'unit' => "м²",
                'price' => 20.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Шпатлевка потолка",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Окраска потолка (слой)",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство карниза декоративного (галтель)",
                'unit' => "м.п.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Шпатлевка и окраска карниза декоративного (галтель)",
                'unit' => "м.п.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Оклейка потолка сеткой \"паутинка\"",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство подвесного потолка из гипсокартона (2-слоя)",
                'unit' => "м²",
                'price' => 600.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Оклейка стен \"паутинка\"",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Шпатлевка гипсокартона",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Шпатлевка стен",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Грунтовка стен (включая каждый этап)",
                'unit' => "м²",
                'price' => 20.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Оклейка стен обоями (без подбора рисунка)",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Оклейка стен обоями (с подбором рисунка)",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Оклейка стен обоями под окраску до 300 квадратов",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Оклейка стен обоями под окраску свыше 300 квадратов",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Окраска стен по обоям",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Шпатлевка откосов (шириной до 400 мм)",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Окраска откосов",
                'unit' => "м.п.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Монтаж малярных уголков",
                'unit' => "м.п.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство откосов из \"панелита\"",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Монтаж стеновых панелей (типа \"панелит\")",
                'unit' => "м²",
                'price' => 600.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Ошкуривание стен",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Облицовка пола керамической плиткой",
                'unit' => "м²",
                'price' => 500.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Облицовка стен керамической плиткой по гипсокартону",
                'unit' => "м²",
                'price' => 700.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Облицовка откосов, полуколонн керамической плиткой",
                'unit' => "м.п.",
                'price' => 500.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Облицовка стен керамической плиткой (с выравниванием стены)",
                'unit' => "м²",
                'price' => 500.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Сверление отверстий в керамической плитке",
                'unit' => "шт.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Затирка швов",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство декоративного экрана ванны",
                'unit' => "шт.",
                'price' => 1300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Установка бордюра, плинтуса керамического",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Изготовление ревизий на магнитном креплении",
                'unit' => "шт.",
                'price' => 800.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Обработка углов помещений уголками, раскладками",
                'unit' => "м.пог.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Мозаика",
                'unit' => "м²",
                'price' => 1300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка художественного паркета",
                'unit' => "м²",
                'price' => 2000.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка штучного паркета",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Уклада штучного паркета сложных рисунков",
                'unit' => "м²",
                'price' => 600.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка паркетной доски плавающим способом",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка паркетной доски на клей",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка массивной доски",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка замкового ламината по прямой",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка замкового ламината по диагонали",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка ламината лесенкой",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка клеевого ламината по прямой",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка клеевого ламината по диагонали",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Выравнивание пола (цементно-песчаная смесь)",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка фанеры с креплением на лаги",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка фанеры с креплением на бетонное основание",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка фанеры с креплением на деревянное основание",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка тепло-звукоизоляции пола (однослойной)",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Циклёвка фанеры",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Шпатлевка паркетных полов",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Циклевка паркета, шлифовка",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Монтаж плинтуса",
                'unit' => "м.п.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Монтаж порога",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Лакировка паркета",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Разборка старого пола",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Очистка стяжки от битумной мастики, клея",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Укладка подложки под ламинат, паркетную доску",
                'unit' => "м²",
                'price' => 30.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство пола из коммерческого линолеума",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство пола из коммерческого линолеума с изготовлением рисунка",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Устройство пола из ковровой плитки",
                'unit' => "м²",
                'price' => 500.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Штукатурка потолка",
                'unit' => "м²",
                'price' => 800.00,
                'link' => "#"
            ],
            [
                'section' => "Ремонт и отделка",
                'name' => "Выравнивание пола (самовыравнивающиеся полы)",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],

            // Строительство заборов
            [
                'section' => "Строительство заборов",
                'name' => "Разбивка участка, вынос координат объекта",
                'unit' => "точка",
                'price' => 2300.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство заборов",
                'name' => "Разработка грунта механизированным способом",
                'unit' => "м3",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство заборов",
                               'name' => "Разработка грунта вручную",
                'unit' => "м3",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство заборов",
                'name' => "Подготовка уплотненного основания из песка вручную послойно до 300 мм",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство заборов",
                'name' => "Подготовка уплотненного основания из щебня вручную послойно до 300 мм",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство заборов",
                'name' => "Монтаж столба из трубы НКТ-73 / НКТ-89 с учетом бурения углубления",
                'unit' => "шт.",
                'price' => 1600.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство заборов",
                'name' => "Монтаж 2 поперечных прожилин",
                'unit' => "м.п.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство заборов",
                'name' => "Монтаж листового ограждения на прожилины",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство заборов",
                'name' => "Устройство монолитных ж/б основания под забор, включая арматурные и опалубочные работы",
                'unit' => "м3",
                'price' => 2200.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство заборов",
                'name' => "Кирпичная кладка тумбы",
                'unit' => "шт.",
                'price' => 1300.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство заборов",
                'name' => "Кирпичная кладка рядов между тумбами",
                'unit' => "м²",
                'price' => 600.00,
                'link' => "#"
            ],

            // Строительство фундамента
            [
                'section' => "Строительство фундамента",
                'name' => "Монтаж винтовой сваи",
                'unit' => "шт.",
                'price' => 700.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Устройство монолитных ж/б ростверков, лент, включая арматурные и опалубочные работы",
                'unit' => "м3",
                'price' => 2800.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Устройство монолитных ж/б стен цоколя, включая арматурные и опалубочные работы",
                'unit' => "м3",
                'price' => 2500.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Устройство монолитных фундаментных плит",
                'unit' => "м3",
                'price' => 1200.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Устройство монолитных ж/б колонн",
                'unit' => "м.п.",
                'price' => 4800.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Устройство монолитных ж/б лестниц, включая арматурные и опалубочные работы 1 ступень",
                'unit' => "шт.",
                'price' => 1400.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Устройство горизонтальной оклеечной гидроизоляции",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Устройство вертикальной оклеечной гидроизоляции",
                'unit' => "м²",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Устройство горизонтальной обмазочной гидроизоляции битумом (2 слоя)",
                'unit' => "м²",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Устройство вертикальной обмазочной гидроизоляции битумом (2 слоя)",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Утепление под монолитным перекрытием/отмосткой ЭППС толщиной до 100 мм",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Утепление вертикальное фундамента, стен цоколя ЭППС толщиной до 100 мм",
                'unit' => "м²",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Монтаж ФБС блоков",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Монтаж плиты перекрытия",
                'unit' => "шт.",
                'price' => 1300.00,
                'link' => "#"
            ],
            [
                'section' => "Строительство фундамента",
                'name' => "Услуги крана",
                'unit' => "час",
                'price' => 1000.00,
                'link' => "#"
            ],

            // Электромонтажные работы
            [
                'section' => "Электромонтажные работы",
                'name' => "Установка электросчетчика",
                'unit' => "шт.",
                'price' => 1100.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Установка автомата",
                'unit' => "шт.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Установка розетки, выключателя (без штробления) с механизмом и коробкой",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Штробление гнезда под выключатель, розетку (в бетонной стене)",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Штробление гнезда под выключатель, роз. (в кирпичной/пеноблочной стене)",
                'unit' => "шт.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Штробление канала для проводки кабеля (в бетонной стене)",
                'unit' => "м.п.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Штробление канала для проводки кабеля (в кирпичной/пеноблочной стене)",
                'unit' => "м.п.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Проводка кабеля",
                'unit' => "м.п.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Проводка кабеля в гофре (включая протяжку кабеля в гофру)",
                'unit' => "м.п.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Установка светильника",
                'unit' => "шт.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Установка трансформатора (на освещение)",
                'unit' => "шт.",
                'price' => 200.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Монтаж и подключение люстры",
                'unit' => "шт.",
                'price' => 400.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Установка пакетника, УЗО",
                'unit' => "шт.",
                'price' => 800.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Электрощит монтаж",
                'unit' => "шт.",
                'price' => 2700.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Вентилятор (установка в вытяжку, подключение)",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Установка звонка",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Установка соединительной коробки",
                'unit' => "шт.",
                'price' => 300.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Устройство теплых полов",
                'unit' => "м²",
                'price' => 500.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Заделка штробы",
                'unit' => "м.п.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Сверление отверстий в ГКЛ",
                'unit' => "шт.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Сверление отверстий в реечном потолке",
                'unit' => "шт.",
                'price' => 100.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Подключение инвертора",
                'unit' => "шт.",
                'price' => 5000.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Подключение генератора",
                'unit' => "шт.",
                'price' => 6400.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Подключение стабилизатора",
                'unit' => "шт.",
                'price' => 3300.00,
                'link' => "#"
            ],
            [
                'section' => "Электромонтажные работы",
                'name' => "Устройство контура заземления (с материалом)",
                'unit' => "шт.",
                'price' => 10000.00,
                'link' => "#"
            ],
        ];


        foreach ($data as $item) {
            DB::table("prices")->insert($item);
        }
    }
}
