<?php
return [
    'types' => [
        'doma' => [
            'slug' => 'doma',
            'name' => 'Дом',
            'title' => 'Проекты домов в [city|pp]',
            'subtitle' => 'Представляем Вашему вниманию каталог проектов домов доступных для заказа',
        ],

        'bani' => [
            'slug' => 'bani',
            'name' => 'Баня',
            'title' => 'Проекты бань в [city|pp]',
            'subtitle' => 'Представляем Вашему вниманию каталог проектов бань доступных для заказа',
        ],
    ],

    'wall_materials' => [
        'sip-paneli' => [
            'slug' => 'sip-paneli',
            'name' => 'СИП-панели',
            'title' => 'Дома из СИП-панелей в [city|pp]',
            'subtitle' => 'Каталог проектов домов из СИП-панелей, доступных для заказа',
        ],
        'karkasnye-doma' => [
            'slug' => 'karkasnye-doma',
            'name' => 'Каркасные дома',
            'title' => 'Каркасные дома в [city|pp]',
            'subtitle' => 'Каталог проектов каркасных домов, доступных для заказа',
        ],
        'penoblok' => [
            'slug' => 'penoblok',
            'name' => 'Пеноблок',
            'title' => 'Дома из пеноблока в [city|pp]',
            'subtitle' => 'Каталог проектов домов из пеноблока, доступных для заказа',
        ],
        'kirpich' => [
            'slug' => 'kirpich',
            'name' => 'Кирпич',
            'title' => 'Дома из кирпича в [city|pp]',
            'subtitle' => 'Каталог проектов домов из кирпича, доступных для заказа',
        ],
        'gazobeton' => [
            'slug' => 'gazobeton',
            'name' => 'Газобетон',
            'title' => 'Дома из газобетона в [city|pp]',
            'subtitle' => 'Каталог проектов домов из газобетона, доступных для заказа',
        ],
        'brus' => [
            'slug' => 'brus',
            'name' => 'Брус',
            'title' => 'Дома из бруса в [city|pp]',
            'subtitle' => 'Каталог проектов домов из бруса, доступных для заказа',
        ],
        'pshch-bloki' => [
            'slug' => 'pshch-bloki',
            'name' => 'ПЩС-блоки',
            'title' => 'Дома из ПЩС-блоков в [city|pp]',
            'subtitle' => 'Каталог проектов домов из ПЩС-блоков, доступных для заказа',
        ],
        'teplokeramika' => [
            'slug' => 'teplokeramika',
            'name' => 'Пеноблок',
            'title' => 'Дома из теплокерамики в [city|pp]',
            'subtitle' => 'Каталог проектов домов из теплокерамики, доступных для заказа',
        ],
        'kleenyy-brus' => [
            'slug' => 'kleenyy-brus',
            'name' => 'Клеёный брус',
            'title' => 'Дома из клеёного бруса в [city|pp]',
            'subtitle' => 'Каталог проектов домов из клеёного бруса, доступных для заказа',
        ],
        'profilovannyy-brus' => [
            'slug' => 'profilovannyy-brus',
            'name' => 'Профилированный брус',
            'title' => 'Дома из профилированного бруса в [city|pp]',
            'subtitle' => 'Каталог проектов домов из профилированного бруса, доступных для заказа',
        ],
        'otsilindrovannoe-brevno' => [
            'slug' => 'otsilindrovannoe-brevno',
            'name' => 'Оцилиндрованное бревно',
            'title' => 'Дома из оцилиндрованного бревна в [city|pp]',
            'subtitle' => 'Каталог проектов домов из оцилиндрованного бревна, доступных для заказа',
        ],
    ],

    'floors' => [
        '1' => [
            'slug' => '1',
            'name' => '1 этаж',
            'title' => 'Дома в 1 этаж в [city|pp]',
            'subtitle' => 'Каталог проектов одноэтажных домов, доступных для заказа',
        ],
        '2' => [
            'slug' => '2',
            'name' => '2 этажа',
            'title' => 'Дома в 2 этажа в [city|pp]',
            'subtitle' => 'Каталог проектов двухэтажных домов, доступных для заказа',
        ],
        '3' => [
            'slug' => '3',
            'name' => '3 этажа',
            'title' => 'Дома в 3 этажа в [city|pp]',
            'subtitle' => 'Каталог проектов трёхэтажных домов, доступных для заказа',
        ],
    ],
];
